RESTful/app/controllers/categories_controller.rb

INSERT INTO `categories` (`catname`, `created_at`, `updated_at`, `description`) VALUES('Clothes', '2012-02-22 04:57:10', '2012-02-22 04:57:10', 'Clothes contains the materials like shirt , t-shirt, pant')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
---
  def update
    @category = Category.find(params[:id])

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
SELECT * FROM `products` WHERE (`products`.`category_id` = 1) LIMIT 1
DELETE FROM `categories` WHERE `id` = 5
---
  def destroy
 #   @category = Category.find(params[:id])
  #  @category.destroy
@category = Category.find(params[:id])
        puts @category.id
        @products = Product.new

        @products = Product.find_by_category_id(@category.id)
        #       puts @products.catagory_id
        if @products == nil
                @category.destroy