RESTful/app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT * FROM `products` WHERE (`products`.category_id = 1)

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`created_at`, `updated_at`, `category_id`, `pname`) VALUES('2012-02-22 05:03:03', '2012-02-22 05:03:03', 1, 'shirt')

  def update
    @product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 9)