RESTful/app/controllers/product_sizes_controller.rb

  def index
    @product_sizes = ProductSize.all
---
SELECT * FROM `product_sizes`

  def show
    @product_size = ProductSize.find(params[:id])
---
SELECT * FROM `product_sizes` WHERE (`product_sizes`.`id` = 1)

  def create
    @product_size = ProductSize.new(params[:product_size])

    respond_to do |format|
      if @product_size.save
---
INSERT INTO `product_sizes` (`product_id`, `size_id`) VALUES(2, NULL)

  def destroy
    @product_size = ProductSize.find(params[:id])
    @product_size.destroy
---
SELECT * FROM `product_sizes` WHERE (`product_sizes`.`id` = 1)
DELETE FROM `product_sizes` WHERE `id` = 1